## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                         NAME                                                         |
|--------|----------------------------------------------------------------------------------------------------------------------|
| add    | `module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]` |
|        | `module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|        | `module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`       |
|        | `module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
| update | `module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]`                                             |
|        | `module.notify_slack_general.module.lambda.aws_lambda_function.this[0]`                                              |
|        | `module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]`                                                   |
|        | `module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]`                                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip" -> "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.zip"
        id                             = "notify-slack-critical"
      ~ last_modified                  = "2023-04-11T15:59:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-critical"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-critical"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/426ff060077d19a65faa8d89e6af6273a3a6d70524f356cd1c2b2e846be19aa2.zip" -> "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.zip"
        id                             = "notify-slack-general"
      ~ last_modified                  = "2023-04-11T15:59:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:6/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-general"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-general"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9b5dda4d6aef364170d47200ab4ce3c1ccceca2124ebf7cb48eab50e28bb4560.zip" -> "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.zip"
        id                             = "notify-slack-ok"
      ~ last_modified                  = "2023-04-11T15:59:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:2/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-ok"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-ok"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip" -> "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.zip"
        id                             = "notify-slack-warning"
      ~ last_modified                  = "2023-04-11T15:59:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-warning"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-warning"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 51 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical[0]"]
WARN -...
```

</details>
